Global.BattleConstants = {
	-- 战斗最大帧数
	BATTLE_MAX_FRAME = 9999999,
	-- 怪物路径长度
	BATTLE_ROAD_LENGTH = 250000,
	-- 战场塔数量
	BATTLE_MAX_TOWER = 15,
	-- 战斗初始点数
	BATTLE_INIT_POINT = 100,
	-- 战斗点数消耗步进
	BATTLE_COST_POINT_STEP = 10,
	-- 战斗飞行道具飞行时长
	BATTLE_MISSILE_TIME = 200,
	-- 碰撞体延迟生效时长
	BATTLE_COLLIDER_DELAY_TIME = 200,
	-- 塔十字站位表
	BATTLE_TOWER_CROSS_MAP = {
		{ 2, 6 },
		{ 1, 3, 7 },
		{ 2, 4, 8 },
		{ 3, 5, 9 },
		{ 4, 10 },
		{ 1, 7, 11 },
		{ 2, 6, 8, 12 },
		{ 3, 7, 9, 13 },
		{ 4, 8, 10, 14 },
		{ 5, 9, 15 },
		{ 6, 12 },
		{ 7, 11, 13 },
		{ 8, 12, 14 },
		{ 9, 13, 15 },
		{ 10, 14 }
	},
	-- 玩家总血量
	BATTLE_PLAYER_TOTAL_HP = 3,
	-- 塔颜色
	BATTLE_TOWER_COLOR_LIST = {
		['火'] = { 200, 12, 0 },
		['电'] = {0, 0, 0},
		['风'] = { 0, 207, 148 },
		['毒'] = {0, 0, 0},
		['冰'] = { 0, 146, 207 },
		['幸运'] = { 208, 52, 245 },
		['强攻'] = { 0, 63, 26 },
		['禁锢'] = { 0, 15, 245 },
		['疯狂'] = { 0, 0, 0 },
	},
	-- 格子状态颜色
	BATTLE_BUFFER_COLOR_LIST = {
		[1] = { 200, 12, 0 },
		[2] = { 0, 207, 148 },
		[3] = { 0, 146, 207 },
		[4] = { 208, 52, 245 },
		[5] = { 0, 15, 245 },
		[6] = { 0, 63, 26 },
		[7] = { 200, 12, 0 },
		[8] = { 0, 207, 148 },
		[9] = { 0, 146, 207 },
		[10] = { 208, 52, 245 },
		[11] = { 0, 15, 245 },
		[12] = { 0, 63, 26 },
		[13] = { 200, 12, 0 },
		[14] = { 0, 207, 148 },
		[15] = { 0, 146, 207 },
		[16] = { 208, 52, 245 },
		[17] = { 0, 15, 245 },
		[18] = { 0, 63, 26 },
		[19] = { 200, 12, 0 },
		[20] = { 0, 207, 148 },
		[21] = { 0, 146, 207 },
		[22] = { 208, 52, 245 },
		[23] = { 0, 15, 245 },
		[24] = { 0, 63, 26 },
	},
	-- 属性百分比限制
	BATTLE_ATTRIBUTE_LIMIT = {
		-- HP
		[1] = {
		},
		--  ATTACK
		[2] = {

		},
		-- DEFENCE
		[3] = {
		},
		-- ATKSPEED
		[4] = {
			min = 100,
			max = 5000,
		},
		-- SPEED
		[5] = {
			min = 0,
			max = 1000,
		},
		-- POINT
		[6] = {
		},
		-- EXATKSPEED
		[7] = {
			min = 100,
			max = 5000,
		},
		-- SPEEDPERCENT
		[13] = {
			min = 0.45,
			max = 2,
		},
	}
}
export('BattleConstants', BattleConstants)